<?php

return [

    'name_required' => 'د کارن نوم فیلډ اړین دی.',
    'name_string' => 'د کارن نوم باید متن وي.',
    'name_max' => 'د کارن نوم باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'name_unique' => 'دغه کارن نوم مخکې ثبت شوی دی.',

    'name_fa_required' => 'د نوم فیلډ اړین دی.',
    'name_fa_string' => 'نوم باید متن وي.',
    'name_fa_max' => 'نوم باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'name_en_string' => 'انګلیسي نوم باید متن وي.',
    'name_en_max' => 'انګلیسي نوم باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'family_name_fa_string' => 'د کورنۍ نوم باید متن وي.',
    'family_name_fa_max' => 'د کورنۍ نوم باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'family_name_en_string' => 'د کورنۍ نوم (انګلیسي) باید متن وي.',
    'family_name_en_max' => 'د کورنۍ نوم (انګلیسي) باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'phone_required' => 'د تلیفون فیلډ اړین دی.',
    'phone_string' => 'تلیفون باید متن وي.',
    'phone_max' => 'تلیفون باید تر ۱۶ کرکټرونو زیات نه وي.',
    'phone_unique' => 'دغه تلیفون مخکې ثبت شوی دی.',

    'affiliation_fa_string' => 'وابستګي باید متن وي.',
    'affiliation_fa_max' => 'وابستګي باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'affiliation_en_string' => 'وابستګي (انګلیسي) باید متن وي.',
    'affiliation_en_max' => 'وابستګي (انګلیسي) باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'country_required' => 'د هیواد فیلډ اړین دی.',
    'country_integer' => 'د هیواد ارزښت ناسم دی.',
    'country_min' => 'مهرباني وکړئ یو معتبر هیواد انتخاب کړئ.',

    'education_degree_required' => 'د تحصیلي درجې فیلډ اړین دی.',
    'education_degree_integer' => 'د تحصیلي درجې ارزښت ناسم دی.',

    'academic_rank_required' => 'د علمی رتبه فیلډ اړین دی.',
    'academic_rank_integer' => 'د علمی رتبه ارزښت ناسم دی.',

    'province_required' => 'د ولایت فیلډ اړین دی.',
    'province_integer' => 'د ولایت ارزښت ناسم دی.',

    'city_fa_string' => 'د ښار نوم باید متن وي.',
    'city_fa_max' => 'د ښار نوم باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'city_en_string' => 'د ښار نوم (انګلیسي) باید متن وي.',
    'city_en_max' => 'د ښار نوم (انګلیسي) باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'department_fa_required' => 'د څانګې فیلډ اړین دی.',
    'department_fa_string' => 'څانګه باید متن وي.',
    'department_fa_max' => 'څانګه باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'department_en_string' => 'څانګه (انګلیسي) باید متن وي.',
    'department_en_max' => 'څانګه (انګلیسي) باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'research_area_fa_required' => 'د څیړنې ساحه فیلډ اړین دی.',
    'research_area_fa_string' => 'څیړنیزه ساحه باید متن وي.',
    'research_area_fa_max' => 'څیړنیزه ساحه باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'research_area_en_string' => 'څیړنیزه ساحه (انګلیسي) باید متن وي.',
    'research_area_en_max' => 'څیړنیزه ساحه (انګلیسي) باید تر ۲۵۵ کرکټرونو زیات نه وي.',

    'email_required' => 'د ایمیل فیلډ اړین دی.',
    'email_string' => 'ایمیل باید متن وي.',
    'email_email' => 'ایمیل نامعتبر دی.',
    'email_max' => 'ایمیل باید تر ۲۵۵ کرکټرونو زیات نه وي.',
    'email_unique' => 'دغه ایمیل مخکې ثبت شوی دی.',

    'password_required'   => 'د پټنوم ډکول اړین دي.',
    'password_string'     => 'پټنوم باید د متن په بڼه وي.',
    'password_confirmed'  => 'د پټنوم تایید سمون نه خوري.',
    'password_min'        => 'پټنوم باید لږ تر لږه ۸ توري ولري.',
    'password_uppercase'  => 'پټنوم باید لږ تر لږه یو لوی توری (A-Z) ولري.',
    'password_regex' => 'پټنوم باید لږ تر لږه یو لوی توری (A-Z)، یو عدد او یو ځانګړی نښه (@$!%*#?&) ولري.',
    'recaptcha' => 'مهرباني وکړئ تایید کړئ چې تاسو روباټ نه یاست.',


];
